KoSik-prog/STM32F103_HotPlate/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define AC_ZERO_Pin GPIO_PIN_13
#define AC_ZERO_GPIO_Port GPIOC
#define AC_ZERO_EXTI_IRQn EXTI15_10_IRQn
#define ENC_1_Pin GPIO_PIN_0
#define ENC_1_GPIO_Port GPIOA
#define ENC_1_EXTI_IRQn EXTI0_IRQn
#define ENC_2_Pin GPIO_PIN_1
#define ENC_2_GPIO_Port GPIOA
#define BUTTON_1_Pin GPIO_PIN_2
#define BUTTON_1_GPIO_Port GPIOA
#define BUTTON_1_EXTI_IRQn EXTI2_IRQn
#define OLED_CS_Pin GPIO_PIN_0
#define OLED_CS_GPIO_Port GPIOB
#define OLED_RES_Pin GPIO_PIN_1
#define OLED_RES_GPIO_Port GPIOB
#define OLED_DC_Pin GPIO_PIN_2
#define OLED_DC_GPIO_Port GPIOB
#define MAX6675_1_CS_Pin GPIO_PIN_12
#define MAX6675_1_CS_GPIO_Port GPIOB
#define MAX6675_2_CS_Pin GPIO_PIN_8
#define MAX6675_2_CS_GPIO_Port GPIOA
#define FAN1_Pin GPIO_PIN_9
#define FAN1_GPIO_Port GPIOA
#define FAN2_Pin GPIO_PIN_10
#define FAN2_GPIO_Port GPIOA
#define BUZZER_Pin GPIO_PIN_4
#define BUZZER_GPIO_Port GPIOB
#define AC_PWM1_Pin GPIO_PIN_6
#define AC_PWM1_GPIO_Port GPIOB
#define AC_PWM2_Pin GPIO_PIN_7
#define AC_PWM2_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
